research/visualization_methods/outputs/Model__hgf/hgf.dot
digraph G {
  "GCV" [label="GCV"];
  "Normal" [label="Normal"];
  "mean" [label="mean"];
  "variance" [label="variance"];
  "x_next" [label="x_next"];
  "x_prev" [label="x_prev"];
  "x_prev_mean" [label="x_prev_mean"];
  "x_prev_var" [label="x_prev_var"];
  "y" [label="y"];
  "y_variance" [label="y_variance"];
  "z_next" [label="z_next"];
  "z_prev" [label="z_prev"];
  "z_prev_mean" [label="z_prev_mean"];
  "z_prev_var" [label="z_prev_var"];
  "z_variance" [label="z_variance"];
  "κ" [label="κ"];
  "ω" [label="ω"];
  "GCV" -> "x_next";
  "Normal" -> "x_prev";
  "Normal" -> "y";
  "Normal" -> "z_next";
  "Normal" -> "z_prev";
  "mean" -> "x_prev";
  "mean" -> "y";
  "mean" -> "z_next";
  "mean" -> "z_prev";
  "variance" -> "x_prev";
  "variance" -> "y";
  "variance" -> "z_next";
  "variance" -> "z_prev";
  "x_next" -> "y";
  "x_prev" -> "x_next";
  "x_prev_mean" -> "x_prev";
  "x_prev_var" -> "x_prev";
  "y_variance" -> "y";
  "z_next" -> "x_next";
  "z_prev" -> "z_next";
  "z_prev_mean" -> "z_prev";
  "z_prev_var" -> "z_prev";
  "z_variance" -> "z_next";
  "κ" -> "x_next";
  "ω" -> "x_next";
}
